Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_ls00_curiosity_pro/pic32cm_ls00_cpro_tz_getting_started/firmware/NonSecure/firmware/src/packs/PIC32CM5164LS00100_DFP/component/oscctrl.h
#define OSCCTRL_INTFLAG_XOSCRDY_Pos           _UINT32_(0)                                          /* (OSCCTRL_INTFLAG) XOSC Ready Position */
#define OSCCTRL_INTFLAG_XOSCRDY_Msk           (_UINT32_(0x1) << OSCCTRL_INTFLAG_XOSCRDY_Pos)       /* (OSCCTRL_INTFLAG) XOSC Ready Mask */
#define OSCCTRL_INTFLAG_XOSCRDY(value)        (OSCCTRL_INTFLAG_XOSCRDY_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_XOSCRDY_Pos)) /* Assigment of value for XOSCRDY in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_XOSCFAIL_Pos          _UINT32_(1)                                          /* (OSCCTRL_INTFLAG) XOSC Clock Failure Detector Position */
#define OSCCTRL_INTFLAG_XOSCFAIL_Msk          (_UINT32_(0x1) << OSCCTRL_INTFLAG_XOSCFAIL_Pos)      /* (OSCCTRL_INTFLAG) XOSC Clock Failure Detector Mask */
#define OSCCTRL_INTFLAG_XOSCFAIL(value)       (OSCCTRL_INTFLAG_XOSCFAIL_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_XOSCFAIL_Pos)) /* Assigment of value for XOSCFAIL in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_OSC16MRDY_Pos         _UINT32_(4)                                          /* (OSCCTRL_INTFLAG) OSC16M Ready Position */
#define OSCCTRL_INTFLAG_OSC16MRDY_Msk         (_UINT32_(0x1) << OSCCTRL_INTFLAG_OSC16MRDY_Pos)     /* (OSCCTRL_INTFLAG) OSC16M Ready Mask */
#define OSCCTRL_INTFLAG_OSC16MRDY(value)      (OSCCTRL_INTFLAG_OSC16MRDY_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_OSC16MRDY_Pos)) /* Assigment of value for OSC16MRDY in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DFLLULPRDY_Pos        _UINT32_(8)                                          /* (OSCCTRL_INTFLAG) DFLLULP Ready Position */
#define OSCCTRL_INTFLAG_DFLLULPRDY_Msk        (_UINT32_(0x1) << OSCCTRL_INTFLAG_DFLLULPRDY_Pos)    /* (OSCCTRL_INTFLAG) DFLLULP Ready Mask */
#define OSCCTRL_INTFLAG_DFLLULPRDY(value)     (OSCCTRL_INTFLAG_DFLLULPRDY_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DFLLULPRDY_Pos)) /* Assigment of value for DFLLULPRDY in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DFLLULPLOCK_Pos       _UINT32_(9)                                          /* (OSCCTRL_INTFLAG) DFLLULP Lock Position */
#define OSCCTRL_INTFLAG_DFLLULPLOCK_Msk       (_UINT32_(0x1) << OSCCTRL_INTFLAG_DFLLULPLOCK_Pos)   /* (OSCCTRL_INTFLAG) DFLLULP Lock Mask */
#define OSCCTRL_INTFLAG_DFLLULPLOCK(value)    (OSCCTRL_INTFLAG_DFLLULPLOCK_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DFLLULPLOCK_Pos)) /* Assigment of value for DFLLULPLOCK in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DFLLULPNOLOCK_Pos     _UINT32_(10)                                         /* (OSCCTRL_INTFLAG) DFLLULP No Lock Position */
#define OSCCTRL_INTFLAG_DFLLULPNOLOCK_Msk     (_UINT32_(0x1) << OSCCTRL_INTFLAG_DFLLULPNOLOCK_Pos) /* (OSCCTRL_INTFLAG) DFLLULP No Lock Mask */
#define OSCCTRL_INTFLAG_DFLLULPNOLOCK(value)  (OSCCTRL_INTFLAG_DFLLULPNOLOCK_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DFLLULPNOLOCK_Pos)) /* Assigment of value for DFLLULPNOLOCK in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DPLLLCKR_Pos          _UINT32_(16)                                         /* (OSCCTRL_INTFLAG) DPLL Lock Rise Position */
#define OSCCTRL_INTFLAG_DPLLLCKR_Msk          (_UINT32_(0x1) << OSCCTRL_INTFLAG_DPLLLCKR_Pos)      /* (OSCCTRL_INTFLAG) DPLL Lock Rise Mask */
#define OSCCTRL_INTFLAG_DPLLLCKR(value)       (OSCCTRL_INTFLAG_DPLLLCKR_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DPLLLCKR_Pos)) /* Assigment of value for DPLLLCKR in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DPLLLCKF_Pos          _UINT32_(17)                                         /* (OSCCTRL_INTFLAG) DPLL Lock Fall Position */
#define OSCCTRL_INTFLAG_DPLLLCKF_Msk          (_UINT32_(0x1) << OSCCTRL_INTFLAG_DPLLLCKF_Pos)      /* (OSCCTRL_INTFLAG) DPLL Lock Fall Mask */
#define OSCCTRL_INTFLAG_DPLLLCKF(value)       (OSCCTRL_INTFLAG_DPLLLCKF_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DPLLLCKF_Pos)) /* Assigment of value for DPLLLCKF in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DPLLLTO_Pos           _UINT32_(18)                                         /* (OSCCTRL_INTFLAG) DPLL Lock Timeout Position */
#define OSCCTRL_INTFLAG_DPLLLTO_Msk           (_UINT32_(0x1) << OSCCTRL_INTFLAG_DPLLLTO_Pos)       /* (OSCCTRL_INTFLAG) DPLL Lock Timeout Mask */
#define OSCCTRL_INTFLAG_DPLLLTO(value)        (OSCCTRL_INTFLAG_DPLLLTO_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DPLLLTO_Pos)) /* Assigment of value for DPLLLTO in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DPLLLDRTO_Pos         _UINT32_(19)                                         /* (OSCCTRL_INTFLAG) DPLL Loop Divider Ratio Update Complete Position */
#define OSCCTRL_INTFLAG_DPLLLDRTO_Msk         (_UINT32_(0x1) << OSCCTRL_INTFLAG_DPLLLDRTO_Pos)     /* (OSCCTRL_INTFLAG) DPLL Loop Divider Ratio Update Complete Mask */
#define OSCCTRL_INTFLAG_DPLLLDRTO(value)      (OSCCTRL_INTFLAG_DPLLLDRTO_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DPLLLDRTO_Pos)) /* Assigment of value for DPLLLDRTO in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DFLLRDY_Pos           _UINT32_(24)                                         /* (OSCCTRL_INTFLAG) DFLL Ready Interrupt Enable Position */
#define OSCCTRL_INTFLAG_DFLLRDY_Msk           (_UINT32_(0x1) << OSCCTRL_INTFLAG_DFLLRDY_Pos)       /* (OSCCTRL_INTFLAG) DFLL Ready Interrupt Enable Mask */
#define OSCCTRL_INTFLAG_DFLLRDY(value)        (OSCCTRL_INTFLAG_DFLLRDY_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DFLLRDY_Pos)) /* Assigment of value for DFLLRDY in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DFLLOOB_Pos           _UINT32_(25)                                         /* (OSCCTRL_INTFLAG) DFLL Out Of Bounds Interrupt Enable Position */
#define OSCCTRL_INTFLAG_DFLLOOB_Msk           (_UINT32_(0x1) << OSCCTRL_INTFLAG_DFLLOOB_Pos)       /* (OSCCTRL_INTFLAG) DFLL Out Of Bounds Interrupt Enable Mask */
#define OSCCTRL_INTFLAG_DFLLOOB(value)        (OSCCTRL_INTFLAG_DFLLOOB_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DFLLOOB_Pos)) /* Assigment of value for DFLLOOB in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DFLLLCKF_Pos          _UINT32_(26)                                         /* (OSCCTRL_INTFLAG) DFLL Lock Fine Interrupt Enable Position */
#define OSCCTRL_INTFLAG_DFLLLCKF_Msk          (_UINT32_(0x1) << OSCCTRL_INTFLAG_DFLLLCKF_Pos)      /* (OSCCTRL_INTFLAG) DFLL Lock Fine Interrupt Enable Mask */
#define OSCCTRL_INTFLAG_DFLLLCKF(value)       (OSCCTRL_INTFLAG_DFLLLCKF_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DFLLLCKF_Pos)) /* Assigment of value for DFLLLCKF in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DFLLLCKC_Pos          _UINT32_(27)                                         /* (OSCCTRL_INTFLAG) DFLL Lock Coarse Interrupt Enable Position */
#define OSCCTRL_INTFLAG_DFLLLCKC_Msk          (_UINT32_(0x1) << OSCCTRL_INTFLAG_DFLLLCKC_Pos)      /* (OSCCTRL_INTFLAG) DFLL Lock Coarse Interrupt Enable Mask */
#define OSCCTRL_INTFLAG_DFLLLCKC(value)       (OSCCTRL_INTFLAG_DFLLLCKC_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DFLLLCKC_Pos)) /* Assigment of value for DFLLLCKC in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_DFLLRCS_Pos           _UINT32_(28)                                         /* (OSCCTRL_INTFLAG) DFLL Reference Clock Stopped Interrupt Enable Position */
#define OSCCTRL_INTFLAG_DFLLRCS_Msk           (_UINT32_(0x1) << OSCCTRL_INTFLAG_DFLLRCS_Pos)       /* (OSCCTRL_INTFLAG) DFLL Reference Clock Stopped Interrupt Enable Mask */
#define OSCCTRL_INTFLAG_DFLLRCS(value)        (OSCCTRL_INTFLAG_DFLLRCS_Msk & (_UINT32_(value) << OSCCTRL_INTFLAG_DFLLRCS_Pos)) /* Assigment of value for DFLLRCS in the OSCCTRL_INTFLAG register */
#define OSCCTRL_INTFLAG_Msk                   _UINT32_(0x1F0F0713)                                 /* (OSCCTRL_INTFLAG) Register Mask  */


/* -------- OSCCTRL_STATUS : (OSCCTRL Offset: 0x10) ( R/ 32) Status -------- */
#define OSCCTRL_STATUS_RESETVALUE             _UINT32_(0x00)                                       /*  (OSCCTRL_STATUS) Status  Reset Value */

#define OSCCTRL_STATUS_XOSCRDY_Pos            _UINT32_(0)                                          /* (OSCCTRL_STATUS) XOSC Ready Position */
#define OSCCTRL_STATUS_XOSCRDY_Msk            (_UINT32_(0x1) << OSCCTRL_STATUS_XOSCRDY_Pos)        /* (OSCCTRL_STATUS) XOSC Ready Mask */
#define OSCCTRL_STATUS_XOSCRDY(value)         (OSCCTRL_STATUS_XOSCRDY_Msk & (_UINT32_(value) << OSCCTRL_STATUS_XOSCRDY_Pos)) /* Assigment of value for XOSCRDY in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_XOSCFAIL_Pos           _UINT32_(1)                                          /* (OSCCTRL_STATUS) XOSC Clock Failure Detector Position */
#define OSCCTRL_STATUS_XOSCFAIL_Msk           (_UINT32_(0x1) << OSCCTRL_STATUS_XOSCFAIL_Pos)       /* (OSCCTRL_STATUS) XOSC Clock Failure Detector Mask */
#define OSCCTRL_STATUS_XOSCFAIL(value)        (OSCCTRL_STATUS_XOSCFAIL_Msk & (_UINT32_(value) << OSCCTRL_STATUS_XOSCFAIL_Pos)) /* Assigment of value for XOSCFAIL in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_XOSCCKSW_Pos           _UINT32_(2)                                          /* (OSCCTRL_STATUS) XOSC Clock Switch Position */
#define OSCCTRL_STATUS_XOSCCKSW_Msk           (_UINT32_(0x1) << OSCCTRL_STATUS_XOSCCKSW_Pos)       /* (OSCCTRL_STATUS) XOSC Clock Switch Mask */
#define OSCCTRL_STATUS_XOSCCKSW(value)        (OSCCTRL_STATUS_XOSCCKSW_Msk & (_UINT32_(value) << OSCCTRL_STATUS_XOSCCKSW_Pos)) /* Assigment of value for XOSCCKSW in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_OSC16MRDY_Pos          _UINT32_(4)                                          /* (OSCCTRL_STATUS) OSC16M Ready Position */
#define OSCCTRL_STATUS_OSC16MRDY_Msk          (_UINT32_(0x1) << OSCCTRL_STATUS_OSC16MRDY_Pos)      /* (OSCCTRL_STATUS) OSC16M Ready Mask */
#define OSCCTRL_STATUS_OSC16MRDY(value)       (OSCCTRL_STATUS_OSC16MRDY_Msk & (_UINT32_(value) << OSCCTRL_STATUS_OSC16MRDY_Pos)) /* Assigment of value for OSC16MRDY in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DFLLULPRDY_Pos         _UINT32_(8)                                          /* (OSCCTRL_STATUS) DFLLULP Ready Position */
#define OSCCTRL_STATUS_DFLLULPRDY_Msk         (_UINT32_(0x1) << OSCCTRL_STATUS_DFLLULPRDY_Pos)     /* (OSCCTRL_STATUS) DFLLULP Ready Mask */
#define OSCCTRL_STATUS_DFLLULPRDY(value)      (OSCCTRL_STATUS_DFLLULPRDY_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DFLLULPRDY_Pos)) /* Assigment of value for DFLLULPRDY in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DFLLULPLOCK_Pos        _UINT32_(9)                                          /* (OSCCTRL_STATUS) DFLLULP Lock Position */
#define OSCCTRL_STATUS_DFLLULPLOCK_Msk        (_UINT32_(0x1) << OSCCTRL_STATUS_DFLLULPLOCK_Pos)    /* (OSCCTRL_STATUS) DFLLULP Lock Mask */
#define OSCCTRL_STATUS_DFLLULPLOCK(value)     (OSCCTRL_STATUS_DFLLULPLOCK_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DFLLULPLOCK_Pos)) /* Assigment of value for DFLLULPLOCK in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DFLLULPNOLOCK_Pos      _UINT32_(10)                                         /* (OSCCTRL_STATUS) DFLLULP No Lock Position */
#define OSCCTRL_STATUS_DFLLULPNOLOCK_Msk      (_UINT32_(0x1) << OSCCTRL_STATUS_DFLLULPNOLOCK_Pos)  /* (OSCCTRL_STATUS) DFLLULP No Lock Mask */
#define OSCCTRL_STATUS_DFLLULPNOLOCK(value)   (OSCCTRL_STATUS_DFLLULPNOLOCK_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DFLLULPNOLOCK_Pos)) /* Assigment of value for DFLLULPNOLOCK in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DPLLLCKR_Pos           _UINT32_(16)                                         /* (OSCCTRL_STATUS) DPLL Lock Rise Position */
#define OSCCTRL_STATUS_DPLLLCKR_Msk           (_UINT32_(0x1) << OSCCTRL_STATUS_DPLLLCKR_Pos)       /* (OSCCTRL_STATUS) DPLL Lock Rise Mask */
#define OSCCTRL_STATUS_DPLLLCKR(value)        (OSCCTRL_STATUS_DPLLLCKR_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DPLLLCKR_Pos)) /* Assigment of value for DPLLLCKR in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DPLLLCKF_Pos           _UINT32_(17)                                         /* (OSCCTRL_STATUS) DPLL Lock Fall Position */
#define OSCCTRL_STATUS_DPLLLCKF_Msk           (_UINT32_(0x1) << OSCCTRL_STATUS_DPLLLCKF_Pos)       /* (OSCCTRL_STATUS) DPLL Lock Fall Mask */
#define OSCCTRL_STATUS_DPLLLCKF(value)        (OSCCTRL_STATUS_DPLLLCKF_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DPLLLCKF_Pos)) /* Assigment of value for DPLLLCKF in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DPLLLTO_Pos            _UINT32_(18)                                         /* (OSCCTRL_STATUS) DPLL Lock Timeout Position */
#define OSCCTRL_STATUS_DPLLLTO_Msk            (_UINT32_(0x1) << OSCCTRL_STATUS_DPLLLTO_Pos)        /* (OSCCTRL_STATUS) DPLL Lock Timeout Mask */
#define OSCCTRL_STATUS_DPLLLTO(value)         (OSCCTRL_STATUS_DPLLLTO_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DPLLLTO_Pos)) /* Assigment of value for DPLLLTO in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DPLLLDRTO_Pos          _UINT32_(19)                                         /* (OSCCTRL_STATUS) DPLL Loop Divider Ratio Update Complete Position */
#define OSCCTRL_STATUS_DPLLLDRTO_Msk          (_UINT32_(0x1) << OSCCTRL_STATUS_DPLLLDRTO_Pos)      /* (OSCCTRL_STATUS) DPLL Loop Divider Ratio Update Complete Mask */
#define OSCCTRL_STATUS_DPLLLDRTO(value)       (OSCCTRL_STATUS_DPLLLDRTO_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DPLLLDRTO_Pos)) /* Assigment of value for DPLLLDRTO in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DFLLRDY_Pos            _UINT32_(24)                                         /* (OSCCTRL_STATUS) DFLL Ready Position */
#define OSCCTRL_STATUS_DFLLRDY_Msk            (_UINT32_(0x1) << OSCCTRL_STATUS_DFLLRDY_Pos)        /* (OSCCTRL_STATUS) DFLL Ready Mask */
#define OSCCTRL_STATUS_DFLLRDY(value)         (OSCCTRL_STATUS_DFLLRDY_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DFLLRDY_Pos)) /* Assigment of value for DFLLRDY in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DFLLOOB_Pos            _UINT32_(25)                                         /* (OSCCTRL_STATUS) DFLL Out Of Bounds Position */
#define OSCCTRL_STATUS_DFLLOOB_Msk            (_UINT32_(0x1) << OSCCTRL_STATUS_DFLLOOB_Pos)        /* (OSCCTRL_STATUS) DFLL Out Of Bounds Mask */
#define OSCCTRL_STATUS_DFLLOOB(value)         (OSCCTRL_STATUS_DFLLOOB_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DFLLOOB_Pos)) /* Assigment of value for DFLLOOB in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DFLLLCKF_Pos           _UINT32_(26)                                         /* (OSCCTRL_STATUS) DFLL Lock Fine Position */
#define OSCCTRL_STATUS_DFLLLCKF_Msk           (_UINT32_(0x1) << OSCCTRL_STATUS_DFLLLCKF_Pos)       /* (OSCCTRL_STATUS) DFLL Lock Fine Mask */
#define OSCCTRL_STATUS_DFLLLCKF(value)        (OSCCTRL_STATUS_DFLLLCKF_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DFLLLCKF_Pos)) /* Assigment of value for DFLLLCKF in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DFLLLCKC_Pos           _UINT32_(27)                                         /* (OSCCTRL_STATUS) DFLL Lock Coarse Position */
#define OSCCTRL_STATUS_DFLLLCKC_Msk           (_UINT32_(0x1) << OSCCTRL_STATUS_DFLLLCKC_Pos)       /* (OSCCTRL_STATUS) DFLL Lock Coarse Mask */
#define OSCCTRL_STATUS_DFLLLCKC(value)        (OSCCTRL_STATUS_DFLLLCKC_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DFLLLCKC_Pos)) /* Assigment of value for DFLLLCKC in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DFLLRCS_Pos            _UINT32_(28)                                         /* (OSCCTRL_STATUS) DFLL Reference Clock Stopped Position */
#define OSCCTRL_STATUS_DFLLRCS_Msk            (_UINT32_(0x1) << OSCCTRL_STATUS_DFLLRCS_Pos)        /* (OSCCTRL_STATUS) DFLL Reference Clock Stopped Mask */
#define OSCCTRL_STATUS_DFLLRCS(value)         (OSCCTRL_STATUS_DFLLRCS_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DFLLRCS_Pos)) /* Assigment of value for DFLLRCS in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_Msk                    _UINT32_(0x1F0F0717)                                 /* (OSCCTRL_STATUS) Register Mask  */


/* -------- OSCCTRL_XOSCCTRL : (OSCCTRL Offset: 0x14) (R/W 16) External Multipurpose Crystal Oscillator (XOSC) Control -------- */
#define OSCCTRL_XOSCCTRL_RESETVALUE           _UINT16_(0x80)                                       /*  (OSCCTRL_XOSCCTRL) External Multipurpose Crystal Oscillator (XOSC) Control  Reset Value */

