Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_ls00_curiosity_pro/pic32cm_ls00_cpro_tz_getting_started/firmware/NonSecure/firmware/src/packs/PIC32CM5164LS00100_DFP/component/oscctrl.h
#define OSCCTRL_XOSCCTRL_ENABLE_Pos           _UINT16_(1)                                          /* (OSCCTRL_XOSCCTRL) Oscillator Enable Position */
#define OSCCTRL_XOSCCTRL_ENABLE_Msk           (_UINT16_(0x1) << OSCCTRL_XOSCCTRL_ENABLE_Pos)       /* (OSCCTRL_XOSCCTRL) Oscillator Enable Mask */
#define OSCCTRL_XOSCCTRL_ENABLE(value)        (OSCCTRL_XOSCCTRL_ENABLE_Msk & (_UINT16_(value) << OSCCTRL_XOSCCTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the OSCCTRL_XOSCCTRL register */
#define OSCCTRL_XOSCCTRL_XTALEN_Pos           _UINT16_(2)                                          /* (OSCCTRL_XOSCCTRL) Crystal Oscillator Enable Position */
#define OSCCTRL_XOSCCTRL_XTALEN_Msk           (_UINT16_(0x1) << OSCCTRL_XOSCCTRL_XTALEN_Pos)       /* (OSCCTRL_XOSCCTRL) Crystal Oscillator Enable Mask */
#define OSCCTRL_XOSCCTRL_XTALEN(value)        (OSCCTRL_XOSCCTRL_XTALEN_Msk & (_UINT16_(value) << OSCCTRL_XOSCCTRL_XTALEN_Pos)) /* Assigment of value for XTALEN in the OSCCTRL_XOSCCTRL register */
#define OSCCTRL_XOSCCTRL_CFDEN_Pos            _UINT16_(3)                                          /* (OSCCTRL_XOSCCTRL) Clock Failure Detector Enable Position */
#define OSCCTRL_XOSCCTRL_CFDEN_Msk            (_UINT16_(0x1) << OSCCTRL_XOSCCTRL_CFDEN_Pos)        /* (OSCCTRL_XOSCCTRL) Clock Failure Detector Enable Mask */
#define OSCCTRL_XOSCCTRL_CFDEN(value)         (OSCCTRL_XOSCCTRL_CFDEN_Msk & (_UINT16_(value) << OSCCTRL_XOSCCTRL_CFDEN_Pos)) /* Assigment of value for CFDEN in the OSCCTRL_XOSCCTRL register */
#define OSCCTRL_XOSCCTRL_SWBEN_Pos            _UINT16_(4)                                          /* (OSCCTRL_XOSCCTRL) Clock Switch Back Enable Position */
#define OSCCTRL_XOSCCTRL_SWBEN_Msk            (_UINT16_(0x1) << OSCCTRL_XOSCCTRL_SWBEN_Pos)        /* (OSCCTRL_XOSCCTRL) Clock Switch Back Enable Mask */
#define OSCCTRL_XOSCCTRL_SWBEN(value)         (OSCCTRL_XOSCCTRL_SWBEN_Msk & (_UINT16_(value) << OSCCTRL_XOSCCTRL_SWBEN_Pos)) /* Assigment of value for SWBEN in the OSCCTRL_XOSCCTRL register */
#define OSCCTRL_XOSCCTRL_RUNSTDBY_Pos         _UINT16_(6)                                          /* (OSCCTRL_XOSCCTRL) Run in Standby Position */
#define OSCCTRL_XOSCCTRL_RUNSTDBY_Msk         (_UINT16_(0x1) << OSCCTRL_XOSCCTRL_RUNSTDBY_Pos)     /* (OSCCTRL_XOSCCTRL) Run in Standby Mask */
#define OSCCTRL_XOSCCTRL_RUNSTDBY(value)      (OSCCTRL_XOSCCTRL_RUNSTDBY_Msk & (_UINT16_(value) << OSCCTRL_XOSCCTRL_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the OSCCTRL_XOSCCTRL register */
#define OSCCTRL_XOSCCTRL_ONDEMAND_Pos         _UINT16_(7)                                          /* (OSCCTRL_XOSCCTRL) On Demand Control Position */
#define OSCCTRL_XOSCCTRL_ONDEMAND_Msk         (_UINT16_(0x1) << OSCCTRL_XOSCCTRL_ONDEMAND_Pos)     /* (OSCCTRL_XOSCCTRL) On Demand Control Mask */
#define OSCCTRL_XOSCCTRL_ONDEMAND(value)      (OSCCTRL_XOSCCTRL_ONDEMAND_Msk & (_UINT16_(value) << OSCCTRL_XOSCCTRL_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the OSCCTRL_XOSCCTRL register */
#define OSCCTRL_XOSCCTRL_GAIN_Pos             _UINT16_(8)                                          /* (OSCCTRL_XOSCCTRL) Oscillator Gain Position */
#define OSCCTRL_XOSCCTRL_GAIN_Msk             (_UINT16_(0x7) << OSCCTRL_XOSCCTRL_GAIN_Pos)         /* (OSCCTRL_XOSCCTRL) Oscillator Gain Mask */
#define OSCCTRL_XOSCCTRL_GAIN(value)          (OSCCTRL_XOSCCTRL_GAIN_Msk & (_UINT16_(value) << OSCCTRL_XOSCCTRL_GAIN_Pos)) /* Assigment of value for GAIN in the OSCCTRL_XOSCCTRL register */
#define   OSCCTRL_XOSCCTRL_GAIN_GAIN2_Val     _UINT16_(0x0)                                        /* (OSCCTRL_XOSCCTRL) 2MHz max  */
#define   OSCCTRL_XOSCCTRL_GAIN_GAIN4_Val     _UINT16_(0x1)                                        /* (OSCCTRL_XOSCCTRL) 4MHz max  */
#define   OSCCTRL_XOSCCTRL_GAIN_GAIN8_Val     _UINT16_(0x2)                                        /* (OSCCTRL_XOSCCTRL) 8MHz max  */
#define   OSCCTRL_XOSCCTRL_GAIN_GAIN16_Val    _UINT16_(0x3)                                        /* (OSCCTRL_XOSCCTRL) 16MHz max  */
#define   OSCCTRL_XOSCCTRL_GAIN_GAIN30_Val    _UINT16_(0x4)                                        /* (OSCCTRL_XOSCCTRL) 30MHz max  */
#define OSCCTRL_XOSCCTRL_GAIN_GAIN2           (OSCCTRL_XOSCCTRL_GAIN_GAIN2_Val << OSCCTRL_XOSCCTRL_GAIN_Pos) /* (OSCCTRL_XOSCCTRL) 2MHz max Position  */
#define OSCCTRL_XOSCCTRL_GAIN_GAIN4           (OSCCTRL_XOSCCTRL_GAIN_GAIN4_Val << OSCCTRL_XOSCCTRL_GAIN_Pos) /* (OSCCTRL_XOSCCTRL) 4MHz max Position  */
#define OSCCTRL_XOSCCTRL_GAIN_GAIN8           (OSCCTRL_XOSCCTRL_GAIN_GAIN8_Val << OSCCTRL_XOSCCTRL_GAIN_Pos) /* (OSCCTRL_XOSCCTRL) 8MHz max Position  */
#define OSCCTRL_XOSCCTRL_GAIN_GAIN16          (OSCCTRL_XOSCCTRL_GAIN_GAIN16_Val << OSCCTRL_XOSCCTRL_GAIN_Pos) /* (OSCCTRL_XOSCCTRL) 16MHz max Position  */
#define OSCCTRL_XOSCCTRL_GAIN_GAIN30          (OSCCTRL_XOSCCTRL_GAIN_GAIN30_Val << OSCCTRL_XOSCCTRL_GAIN_Pos) /* (OSCCTRL_XOSCCTRL) 30MHz max Position  */
#define OSCCTRL_XOSCCTRL_AMPGC_Pos            _UINT16_(11)                                         /* (OSCCTRL_XOSCCTRL) Automatic Amplitude Gain Control Position */
#define OSCCTRL_XOSCCTRL_AMPGC_Msk            (_UINT16_(0x1) << OSCCTRL_XOSCCTRL_AMPGC_Pos)        /* (OSCCTRL_XOSCCTRL) Automatic Amplitude Gain Control Mask */
#define OSCCTRL_XOSCCTRL_AMPGC(value)         (OSCCTRL_XOSCCTRL_AMPGC_Msk & (_UINT16_(value) << OSCCTRL_XOSCCTRL_AMPGC_Pos)) /* Assigment of value for AMPGC in the OSCCTRL_XOSCCTRL register */
#define OSCCTRL_XOSCCTRL_STARTUP_Pos          _UINT16_(12)                                         /* (OSCCTRL_XOSCCTRL) Start-Up Time Position */
#define OSCCTRL_XOSCCTRL_STARTUP_Msk          (_UINT16_(0xF) << OSCCTRL_XOSCCTRL_STARTUP_Pos)      /* (OSCCTRL_XOSCCTRL) Start-Up Time Mask */
#define OSCCTRL_XOSCCTRL_STARTUP(value)       (OSCCTRL_XOSCCTRL_STARTUP_Msk & (_UINT16_(value) << OSCCTRL_XOSCCTRL_STARTUP_Pos)) /* Assigment of value for STARTUP in the OSCCTRL_XOSCCTRL register */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE1_Val _UINT16_(0x0)                                        /* (OSCCTRL_XOSCCTRL) 1 cycle  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE2_Val _UINT16_(0x1)                                        /* (OSCCTRL_XOSCCTRL) 2 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE4_Val _UINT16_(0x2)                                        /* (OSCCTRL_XOSCCTRL) 4 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE8_Val _UINT16_(0x3)                                        /* (OSCCTRL_XOSCCTRL) 8 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE16_Val _UINT16_(0x4)                                        /* (OSCCTRL_XOSCCTRL) 16 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE32_Val _UINT16_(0x5)                                        /* (OSCCTRL_XOSCCTRL) 32 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE64_Val _UINT16_(0x6)                                        /* (OSCCTRL_XOSCCTRL) 64 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE128_Val _UINT16_(0x7)                                        /* (OSCCTRL_XOSCCTRL) 128 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE256_Val _UINT16_(0x8)                                        /* (OSCCTRL_XOSCCTRL) 256 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE512_Val _UINT16_(0x9)                                        /* (OSCCTRL_XOSCCTRL) 512 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE1024_Val _UINT16_(0xA)                                        /* (OSCCTRL_XOSCCTRL) 1024 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE2048_Val _UINT16_(0xB)                                        /* (OSCCTRL_XOSCCTRL) 2048 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE4096_Val _UINT16_(0xC)                                        /* (OSCCTRL_XOSCCTRL) 4096 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE8192_Val _UINT16_(0xD)                                        /* (OSCCTRL_XOSCCTRL) 8192 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE16384_Val _UINT16_(0xE)                                        /* (OSCCTRL_XOSCCTRL) 16384 cycles  */
#define   OSCCTRL_XOSCCTRL_STARTUP_CYCLE32768_Val _UINT16_(0xF)                                        /* (OSCCTRL_XOSCCTRL) 32768 cycles  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE1       (OSCCTRL_XOSCCTRL_STARTUP_CYCLE1_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 1 cycle Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE2       (OSCCTRL_XOSCCTRL_STARTUP_CYCLE2_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 2 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE4       (OSCCTRL_XOSCCTRL_STARTUP_CYCLE4_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 4 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE8       (OSCCTRL_XOSCCTRL_STARTUP_CYCLE8_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 8 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE16      (OSCCTRL_XOSCCTRL_STARTUP_CYCLE16_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 16 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE32      (OSCCTRL_XOSCCTRL_STARTUP_CYCLE32_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 32 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE64      (OSCCTRL_XOSCCTRL_STARTUP_CYCLE64_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 64 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE128     (OSCCTRL_XOSCCTRL_STARTUP_CYCLE128_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 128 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE256     (OSCCTRL_XOSCCTRL_STARTUP_CYCLE256_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 256 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE512     (OSCCTRL_XOSCCTRL_STARTUP_CYCLE512_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 512 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE1024    (OSCCTRL_XOSCCTRL_STARTUP_CYCLE1024_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 1024 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE2048    (OSCCTRL_XOSCCTRL_STARTUP_CYCLE2048_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 2048 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE4096    (OSCCTRL_XOSCCTRL_STARTUP_CYCLE4096_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 4096 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE8192    (OSCCTRL_XOSCCTRL_STARTUP_CYCLE8192_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 8192 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE16384   (OSCCTRL_XOSCCTRL_STARTUP_CYCLE16384_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 16384 cycles Position  */
#define OSCCTRL_XOSCCTRL_STARTUP_CYCLE32768   (OSCCTRL_XOSCCTRL_STARTUP_CYCLE32768_Val << OSCCTRL_XOSCCTRL_STARTUP_Pos) /* (OSCCTRL_XOSCCTRL) 32768 cycles Position  */
#define OSCCTRL_XOSCCTRL_Msk                  _UINT16_(0xFFDE)                                     /* (OSCCTRL_XOSCCTRL) Register Mask  */


/* -------- OSCCTRL_CFDPRESC : (OSCCTRL Offset: 0x16) (R/W 8) Clock Failure Detector Prescaler -------- */
#define OSCCTRL_CFDPRESC_RESETVALUE           _UINT8_(0x00)                                        /*  (OSCCTRL_CFDPRESC) Clock Failure Detector Prescaler  Reset Value */

#define OSCCTRL_CFDPRESC_CFDPRESC_Pos         _UINT8_(0)                                           /* (OSCCTRL_CFDPRESC) Clock Failure Detector Prescaler Position */
#define OSCCTRL_CFDPRESC_CFDPRESC_Msk         (_UINT8_(0x7) << OSCCTRL_CFDPRESC_CFDPRESC_Pos)      /* (OSCCTRL_CFDPRESC) Clock Failure Detector Prescaler Mask */
#define OSCCTRL_CFDPRESC_CFDPRESC(value)      (OSCCTRL_CFDPRESC_CFDPRESC_Msk & (_UINT8_(value) << OSCCTRL_CFDPRESC_CFDPRESC_Pos)) /* Assigment of value for CFDPRESC in the OSCCTRL_CFDPRESC register */
#define   OSCCTRL_CFDPRESC_CFDPRESC_DIV1_Val  _UINT8_(0x0)                                         /* (OSCCTRL_CFDPRESC) OSC16M/1  */
#define   OSCCTRL_CFDPRESC_CFDPRESC_DIV2_Val  _UINT8_(0x1)                                         /* (OSCCTRL_CFDPRESC) OSC16M/2  */
#define   OSCCTRL_CFDPRESC_CFDPRESC_DIV4_Val  _UINT8_(0x2)                                         /* (OSCCTRL_CFDPRESC) OSC16M/4  */
#define   OSCCTRL_CFDPRESC_CFDPRESC_DIV8_Val  _UINT8_(0x3)                                         /* (OSCCTRL_CFDPRESC) OSC16M/8  */
#define   OSCCTRL_CFDPRESC_CFDPRESC_DIV16_Val _UINT8_(0x4)                                         /* (OSCCTRL_CFDPRESC) OSC16M/16  */
#define   OSCCTRL_CFDPRESC_CFDPRESC_DIV32_Val _UINT8_(0x5)                                         /* (OSCCTRL_CFDPRESC) OSC16M/32  */
#define   OSCCTRL_CFDPRESC_CFDPRESC_DIV64_Val _UINT8_(0x6)                                         /* (OSCCTRL_CFDPRESC) OSC16M/64  */
#define   OSCCTRL_CFDPRESC_CFDPRESC_DIV128_Val _UINT8_(0x7)                                         /* (OSCCTRL_CFDPRESC) OSC16M/128  */
#define OSCCTRL_CFDPRESC_CFDPRESC_DIV1        (OSCCTRL_CFDPRESC_CFDPRESC_DIV1_Val << OSCCTRL_CFDPRESC_CFDPRESC_Pos) /* (OSCCTRL_CFDPRESC) OSC16M/1 Position  */
#define OSCCTRL_CFDPRESC_CFDPRESC_DIV2        (OSCCTRL_CFDPRESC_CFDPRESC_DIV2_Val << OSCCTRL_CFDPRESC_CFDPRESC_Pos) /* (OSCCTRL_CFDPRESC) OSC16M/2 Position  */
#define OSCCTRL_CFDPRESC_CFDPRESC_DIV4        (OSCCTRL_CFDPRESC_CFDPRESC_DIV4_Val << OSCCTRL_CFDPRESC_CFDPRESC_Pos) /* (OSCCTRL_CFDPRESC) OSC16M/4 Position  */
#define OSCCTRL_CFDPRESC_CFDPRESC_DIV8        (OSCCTRL_CFDPRESC_CFDPRESC_DIV8_Val << OSCCTRL_CFDPRESC_CFDPRESC_Pos) /* (OSCCTRL_CFDPRESC) OSC16M/8 Position  */
#define OSCCTRL_CFDPRESC_CFDPRESC_DIV16       (OSCCTRL_CFDPRESC_CFDPRESC_DIV16_Val << OSCCTRL_CFDPRESC_CFDPRESC_Pos) /* (OSCCTRL_CFDPRESC) OSC16M/16 Position  */
#define OSCCTRL_CFDPRESC_CFDPRESC_DIV32       (OSCCTRL_CFDPRESC_CFDPRESC_DIV32_Val << OSCCTRL_CFDPRESC_CFDPRESC_Pos) /* (OSCCTRL_CFDPRESC) OSC16M/32 Position  */
#define OSCCTRL_CFDPRESC_CFDPRESC_DIV64       (OSCCTRL_CFDPRESC_CFDPRESC_DIV64_Val << OSCCTRL_CFDPRESC_CFDPRESC_Pos) /* (OSCCTRL_CFDPRESC) OSC16M/64 Position  */
#define OSCCTRL_CFDPRESC_CFDPRESC_DIV128      (OSCCTRL_CFDPRESC_CFDPRESC_DIV128_Val << OSCCTRL_CFDPRESC_CFDPRESC_Pos) /* (OSCCTRL_CFDPRESC) OSC16M/128 Position  */
#define OSCCTRL_CFDPRESC_Msk                  _UINT8_(0x07)                                        /* (OSCCTRL_CFDPRESC) Register Mask  */


/* -------- OSCCTRL_OSC16MCTRL : (OSCCTRL Offset: 0x18) (R/W 8) 16MHz Internal Oscillator (OSC16M) Control -------- */
#define OSCCTRL_OSC16MCTRL_RESETVALUE         _UINT8_(0x82)                                        /*  (OSCCTRL_OSC16MCTRL) 16MHz Internal Oscillator (OSC16M) Control  Reset Value */

#define OSCCTRL_OSC16MCTRL_ENABLE_Pos         _UINT8_(1)                                           /* (OSCCTRL_OSC16MCTRL) Oscillator Enable Position */
#define OSCCTRL_OSC16MCTRL_ENABLE_Msk         (_UINT8_(0x1) << OSCCTRL_OSC16MCTRL_ENABLE_Pos)      /* (OSCCTRL_OSC16MCTRL) Oscillator Enable Mask */
#define OSCCTRL_OSC16MCTRL_ENABLE(value)      (OSCCTRL_OSC16MCTRL_ENABLE_Msk & (_UINT8_(value) << OSCCTRL_OSC16MCTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the OSCCTRL_OSC16MCTRL register */
#define OSCCTRL_OSC16MCTRL_FSEL_Pos           _UINT8_(2)                                           /* (OSCCTRL_OSC16MCTRL) Oscillator Frequency Selection Position */
#define OSCCTRL_OSC16MCTRL_FSEL_Msk           (_UINT8_(0x3) << OSCCTRL_OSC16MCTRL_FSEL_Pos)        /* (OSCCTRL_OSC16MCTRL) Oscillator Frequency Selection Mask */
#define OSCCTRL_OSC16MCTRL_FSEL(value)        (OSCCTRL_OSC16MCTRL_FSEL_Msk & (_UINT8_(value) << OSCCTRL_OSC16MCTRL_FSEL_Pos)) /* Assigment of value for FSEL in the OSCCTRL_OSC16MCTRL register */
#define   OSCCTRL_OSC16MCTRL_FSEL_4MHZ_Val    _UINT8_(0x0)                                         /* (OSCCTRL_OSC16MCTRL) 4MHz  */
#define   OSCCTRL_OSC16MCTRL_FSEL_8MHZ_Val    _UINT8_(0x1)                                         /* (OSCCTRL_OSC16MCTRL) 8MHz  */
#define   OSCCTRL_OSC16MCTRL_FSEL_12MHZ_Val   _UINT8_(0x2)                                         /* (OSCCTRL_OSC16MCTRL) 12MHz  */
#define   OSCCTRL_OSC16MCTRL_FSEL_16MHZ_Val   _UINT8_(0x3)                                         /* (OSCCTRL_OSC16MCTRL) 16MHz  */
#define OSCCTRL_OSC16MCTRL_FSEL_4MHZ          (OSCCTRL_OSC16MCTRL_FSEL_4MHZ_Val << OSCCTRL_OSC16MCTRL_FSEL_Pos) /* (OSCCTRL_OSC16MCTRL) 4MHz Position  */
#define OSCCTRL_OSC16MCTRL_FSEL_8MHZ          (OSCCTRL_OSC16MCTRL_FSEL_8MHZ_Val << OSCCTRL_OSC16MCTRL_FSEL_Pos) /* (OSCCTRL_OSC16MCTRL) 8MHz Position  */
#define OSCCTRL_OSC16MCTRL_FSEL_12MHZ         (OSCCTRL_OSC16MCTRL_FSEL_12MHZ_Val << OSCCTRL_OSC16MCTRL_FSEL_Pos) /* (OSCCTRL_OSC16MCTRL) 12MHz Position  */
#define OSCCTRL_OSC16MCTRL_FSEL_16MHZ         (OSCCTRL_OSC16MCTRL_FSEL_16MHZ_Val << OSCCTRL_OSC16MCTRL_FSEL_Pos) /* (OSCCTRL_OSC16MCTRL) 16MHz Position  */
#define OSCCTRL_OSC16MCTRL_RUNSTDBY_Pos       _UINT8_(6)                                           /* (OSCCTRL_OSC16MCTRL) Run in Standby Position */
#define OSCCTRL_OSC16MCTRL_RUNSTDBY_Msk       (_UINT8_(0x1) << OSCCTRL_OSC16MCTRL_RUNSTDBY_Pos)    /* (OSCCTRL_OSC16MCTRL) Run in Standby Mask */
#define OSCCTRL_OSC16MCTRL_RUNSTDBY(value)    (OSCCTRL_OSC16MCTRL_RUNSTDBY_Msk & (_UINT8_(value) << OSCCTRL_OSC16MCTRL_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the OSCCTRL_OSC16MCTRL register */
#define OSCCTRL_OSC16MCTRL_ONDEMAND_Pos       _UINT8_(7)                                           /* (OSCCTRL_OSC16MCTRL) On Demand Control Position */
#define OSCCTRL_OSC16MCTRL_ONDEMAND_Msk       (_UINT8_(0x1) << OSCCTRL_OSC16MCTRL_ONDEMAND_Pos)    /* (OSCCTRL_OSC16MCTRL) On Demand Control Mask */
#define OSCCTRL_OSC16MCTRL_ONDEMAND(value)    (OSCCTRL_OSC16MCTRL_ONDEMAND_Msk & (_UINT8_(value) << OSCCTRL_OSC16MCTRL_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the OSCCTRL_OSC16MCTRL register */
#define OSCCTRL_OSC16MCTRL_Msk                _UINT8_(0xCE)                                        /* (OSCCTRL_OSC16MCTRL) Register Mask  */


/* -------- OSCCTRL_DFLLULPCTRL : (OSCCTRL Offset: 0x1C) (R/W 16) DFLLULP Control -------- */
#define OSCCTRL_DFLLULPCTRL_RESETVALUE        _UINT16_(0x504)                                      /*  (OSCCTRL_DFLLULPCTRL) DFLLULP Control  Reset Value */

